&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура Синт_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	#Вставка
	Элементы.Склад.Подсказка = "Склад отгрузки по правилам Синт";
	#КонецВставки
	Если Параметры.Ключ.Пустая() Тогда
		ЗаполнитьШапкуПоОснованиюНаСервере();
	КонецЕсли;
	Элементы.Склад.Видимость = Истина;
	Элементы.Комментарий.ТолькоПросмотр = Объект.Проведен;
	
КонецПроцедуры

&НаКлиенте
&После("ЗаполнитьШапкуПоОснованиюНаСервере")
Процедура Синт_ЗаполнитьШапкуПоОснованиюНаСервереПосле()
	
	Объект.Комментарий = "Заполнен по основанию";
	
КонецПроцедуры

&НаКлиенте
Процедура Синт_ПриОткрытииПосле(Отказ)
	
	Заголовок = Заголовок + " (Синт)";
	
КонецПроцедуры

&НаКлиенте
Процедура Синт_ПокупательЗаказаПриИзмененииПосле(Элемент)
	
	Объект.Комментарий = "";
	
КонецПроцедуры
