&ИзменениеИКонтроль("СоздатьЗаказПоОснованию")
Функция Синт_СоздатьЗаказПоОснованию(Основание,
	ДанныеЗаполнения, ПроверятьОстатки = Ложь) Экспорт
	
	Заказ = Документы.ЗаказПокупателя.СоздатьДокумент();
	#Вставка
	Заказ.Комментарий = "Создан по основанию";
	#КонецВставки
	Заказ.Заполнить(ДанныеЗаполнения);
	Заказ.Основание = Основание;
	Заказ.Дата = ТекущаяДатаСеанса();
	Если ПроверятьОстатки Тогда
		Заказ.ПроверитьЗаполнение();
	КонецЕсли;
	Возврат Заказ;
	
КонецФункции

&ИзменениеИКонтроль("ТоварыЗаказа")
Функция Синт_ТоварыЗаказа(Заказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПозицииЗаказа.Номенклатура КАК Номенклатура,
	#Удаление
	|	ПозицииЗаказа.Количество КАК Количество
	#КонецУдаления
	#Вставка // Автор 01.10 количество с учетом коэффициента
	|	ПозицииЗаказа.Количество * ПозицииЗаказа.Коэффициент КАК Количество
	#КонецВставки
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ПозицииЗаказа
	|ГДЕ
	|	ПозицииЗаказа.Ссылка = &ЗаказПокупателя
	|УПОРЯДОЧИТЬ ПО
	|	ПозицииЗаказа.НомерСтроки";
	Запрос.УстановитьПараметр("ЗаказПокупателя", Заказ);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции
