&Перед("ПередЗаписью")
Процедура Синт_ПередЗаписьюПеред(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не Синт_ЗаказыСервер.Синт_ПроверитьЗаказ(ЭтотОбъект) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура Синт_ОбработкаПроведенияПосле(Отказ, РежимПроведения)
	
	Если Не Отказ Тогда
		ДополнительныеСвойства.Вставить("Синт_Проведен", Истина);
	КонецЕсли;
	
КонецПроцедуры

&Перед("ОбработкаПроверкиЗаполнения")
Процедура Синт_ОбработкаПроверкиЗаполненияПеред(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Добавить("Склад");
	
КонецПроцедуры

&После("ПриКопировании")
Процедура Синт_ПриКопированииПосле(ОбъектКопирования)
	
	Комментарий = "";
	
КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьСкладВСтроках")
Процедура Синт_ЗаполнитьСкладВСтроках() Экспорт
	
	Для Каждого ПозицияЗаказа Из Товары Цикл
		Если Не ЗначениеЗаполнено(ПозицияЗаказа.Склад) И ЗначениеЗаполнено(Склад) Тогда
			ПозицияЗаказа.Склад = Склад;
		КонецЕсли;
	КонецЦикла;
	#Вставка
	ДополнительныеСвойства.Вставить("Синт_СкладыЗаполнены", Истина);
	#КонецВставки
	
КонецПроцедуры
