#Область ПрограммныйИнтерфейс

// Создает новый заказ по документу-основанию.
//
// Параметры:
//  Основание - ДокументСсылка - документ-основание.
//  ДанныеЗаполнения - Структура - значения реквизитов нового заказа.
//  ПроверятьОстатки - Булево - проверить заполнение нового заказа.
//
// Возвращаемое значение:
//  ДокументОбъект.ЗаказПокупателя - новый заказ.
//
Функция СоздатьЗаказПоОснованию(Основание,
	ДанныеЗаполнения, ПроверятьОстатки = Ложь) Экспорт
	
	Заказ = Документы.ЗаказПокупателя.СоздатьДокумент();
	Заказ.Заполнить(ДанныеЗаполнения);
	Заказ.Основание = Основание;
	Заказ.Дата = ТекущаяДатаСеанса();
	Если ПроверятьОстатки Тогда
		Заказ.ПроверитьЗаполнение();
	КонецЕсли;
	Возврат Заказ;
	
КонецФункции

// Возвращает позиции заказа.
//
// Параметры:
//  Заказ - ДокументСсылка.ЗаказПокупателя - заказ.
//
// Возвращаемое значение:
//  ТаблицаЗначений - позиции.
//
Функция ТоварыЗаказа(Заказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПозицииЗаказа.Номенклатура КАК Номенклатура,
	|	ПозицииЗаказа.Количество КАК Количество
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ПозицииЗаказа
	|ГДЕ
	|	ПозицииЗаказа.Ссылка = &ЗаказПокупателя
	|УПОРЯДОЧИТЬ ПО
	|	ПозицииЗаказа.НомерСтроки";
	Запрос.УстановитьПараметр("ЗаказПокупателя", Заказ);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

#КонецОбласти
