#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ЗаказыСервер.РассчитатьСуммуЗаказа(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Для Каждого ПозицияЗаказа Из Товары Цикл
		Движение = Движения.ТоварыНаСкладах.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Номенклатура = ПозицияЗаказа.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = ПозицияЗаказа.Количество;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЗаказыСервер.ПроверитьЗаполнениеЗаказа(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьСкладВСтроках() Экспорт
	
	Для Каждого ПозицияЗаказа Из Товары Цикл
		Если Не ЗначениеЗаполнено(ПозицияЗаказа.Склад) И ЗначениеЗаполнено(Склад) Тогда
			ПозицияЗаказа.Склад = Склад;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
