#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ЗаполнитьШапкуПоОснованиюНаСервере();
	КонецЕсли;
	Элементы.Склад.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьЗаголовок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Товары.Количество() = 0 И ПустаяСтрока(Объект.Комментарий) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПокупательЗаказаПриИзменении(Элемент)
	
	ПокупательЗаказаПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПокупательЗаказаПриИзмененииНаСервере()
	
	Объект.Склад = Неопределено;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШапкуПоОснованиюНаСервере()
	
	Объект.Дата = ТекущаяДатаСеанса();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовок()
	
	Заголовок = "Заказ " + Объект.Номер;
	
КонецПроцедуры

#КонецОбласти
